Revit 2027 API
ExternalDataManagerDataItemId Properties
The ExternalDataManagerDataItemId type exposes the following members.
Properties
Name | Description
Id |  The identity of the data item.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
ExternalDataManagerDataItemId Class
Autodesk.Revit.UI Namespace